Acá vamos a hacer práctica de lo de udemy solo para practicar nomas y no usalos otros notebooks de las secciones, no importa mucho lo que hay aca porque los ejercicios están en udemy, este notebook es solo de práctica

Seccion1:Pandas1

In [11]:
import pandas as pd


data = {
    'ID': [1, 2, 3, 4, 1],
    'Producto': ['Producto A', 'Producto B', 'Producto C', 'Producto D', 'Producto A'],
    'Cantidad': [10, 20, 30, 40, 50],
    'Precio': [100, 200, 300, 400, 100]
}



df = pd.DataFrame(data)



df_sin_duplicados = df.drop_duplicates(subset=['ID','Producto','Precio'])
df_sin_duplicados

   ID    Producto  Cantidad  Precio
0   1  Producto A        10     100
1   2  Producto B        20     200
2   3  Producto C        30     300
3   4  Producto D        40     400

In [19]:
import pandas as pd

data = {
    'ID': [1, 2, 3, 4],
    'Producto': ['Producto A', 'Producto B', 'Producto C', 'Producto D'],
    'Cantidad': [10, 20, 30, 40],
    'Precio': [100, None, 300, None]
}


df = pd.DataFrame(data)

promedio = df['Precio'].mean()

df_relleno = df.fillna(promedio)
df_relleno

   ID    Producto  Cantidad  Precio
0   1  Producto A        10   100.0
1   2  Producto B        20   200.0
2   3  Producto C        30   300.0
3   4  Producto D        40   200.0

In [30]:
import pandas as pd

# Serie de ventas del mes
ventas_mes = pd.Series([220, 235, 260, 213, 202, 298, 265, 198, 220, 230, 190, 215, 275, 222, 218, 245, 233, 210, 290, 210,
                        215, 220, 225, 230, 245, 250, 260, 270, 280, 295])


total_ventas_mes = ventas_mes.sum()

dia_ventas_mas_bajas = ventas_mes.min()

promedio_ventas_mes = ventas_mes.mean()

np.float64(237.96666666666667)

Seccion2:Pandas2

In [11]:
import pandas as pd

libros = {
    'Titulo':['El Quijote','Cien años de soledad','La odisea'],
    'Autor':['Miguel de Cervantes','Gabriel García Márquez','Homero'],
    'Año':[1605,1967,-800]
}

libros_df = pd.DataFrame(libros)
libros_df

0          Miguel Cervantes
1    Gabriel García Marquez
2                    Homero
Name: Autor, dtype: object

In [23]:
# Datos proporcionados
import pandas as pd
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df_filtrado = pd.DataFrame(data)
df_filtrado = df_filtrado[df_filtrado['Edad'] >= 25]
df_filtrado

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Luis    30  Barcelona
3   Sara    27     Bilbao

In [34]:
import pandas as pd
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)
df['Edad_en_10_años'] = df['Edad'] +10
df['Ciudad'] = df['Ciudad'].str.upper()
df['Es_Mayor_de_25'] = df['Edad']>=25
df

   Nombre  Edad     Ciudad  Edad_en_10_años  Es_Mayor_de_25
0     Ana    25     MADRID               35            True
1    Luis    30  BARCELONA               40            True
2  Carlos    22   VALENCIA               32           False
3    Sara    27     BILBAO               37            True

In [45]:
import pandas as pd
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}

df_ordenado = pd.DataFrame(datos)
df_ordenado=df_ordenado.sort_values('año')
df_ordenado

       titulo   año  rating
1  Pelicula B  2000     6.5
0  Pelicula A  2001     7.2
2  Pelicula C  2005     8.1
3  Pelicula D  2010     7.5

In [49]:
import pandas as pd
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}


df_ordenado = pd.DataFrame(datos)
df_ordenado=df_ordenado.sort_values(['rating','año'],ascending=[False,True])
df_ordenado

       titulo   año  rating
2  Pelicula C  2005     8.1
3  Pelicula D  2010     7.5
0  Pelicula A  2001     7.2
1  Pelicula B  2000     6.5

In [52]:
import pandas as pd
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D', 'Pelicula E'],
    'género': ['Acción', 'Drama', 'Acción', 'Comedia', 'Drama'],
    'rating': [7.2, 8.5, 9.1, 6.5, 7.8]
}


promedio_rating_por_genero = pd.DataFrame(datos)
promedio_rating_por_genero = promedio_rating_por_genero.groupby('género')['rating'].mean()
promedio_rating_por_genero

género
Acción     8.15
Comedia    6.50
Drama      8.15
Name: rating, dtype: float64